app/controllers/songs_controller.rb

  def index
    if params[:artist_id]
      @artist = Artist.find_by_id(params[:artist_id])
      if @artist
        @songs = @artist.songs
      else
        flash[:alert] = "Artist not found"
        redirect_to artists_path
      end
    else
      @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 1]]

  def show
    if params[:artist_id]
      @artist = Artist.find_by_id(params[:artist_id])
      unless @artist
        flash[:alert] = "Artist not found"
        redirect_to artists_path
      end

      @song = Song.find_by(id: params[:id], artist: @artist)
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? AND "songs"."artist_id" IS NULL LIMIT ?  [["id", 1], ["LIMIT", 1]]